template-scripts/templateService/data/script-template.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:acc="http://account.api.pse.aepona.com/">
  <soapenv:Header/>
  <soapenv:Body>
    <acc:script-template>
      <!--Optional:-->
      <callContext>
        <!--Optional:-->
        <additionalContext>
          <!--Zero or more repetitions:-->
          <additionalContext>
            <!--Optional:-->
            <tag>?</tag>
            <!--Optional:-->
            <value>?</value>
          </additionalContext>
        </additionalContext>
        <!--Optional:-->
        <authenticationKey>?</authenticationKey>
        <!--Optional:-->
        <authorizationId>?</authorizationId>
        <!--Optional:-->
        <requestId>?</requestId>
      </callContext>
      <!--Optional:-->
      <sourceAccount>
        <!--Optional:-->
        <accountNumber>?</accountNumber>
        <!--Optional:-->
        <accountType>?</accountType>
        <!--Optional:-->
        <balance>?</balance>
        <!--Optional:-->
        <billingAccountNumber>?</billingAccountNumber>
        <!--Optional:-->
        <CVV>?</CVV>
        <!--Optional:-->
        <cardHolderName>?</cardHolderName>
        <!--Optional:-->
        <cardNumber>?</cardNumber>
        <!--Optional:-->
        <created>?</created>
        <!--Optional:-->
        <currency>?</currency>
        <!--Optional:-->
        <id>?</id>
        <!--Optional:-->
        <idInfo>
          <!--Zero or more repetitions:-->
          <idInfo>
            <!--Optional:-->
            <tag>?</tag>
            <!--Optional:-->
            <value>?</value>
          </idInfo>
        </idInfo>
        <!--Optional:-->
        <issueNumber>?</issueNumber>
        <!--Optional:-->
        <issuer>?</issuer>
        <!--Optional:-->
        <label>?</label>
        <!--Optional:-->
        <lastStateChange>?</lastStateChange>
        <!--Optional:-->
        <name>?</name>
        <!--Optional:-->
        <state>?</state>
        <!--Optional:-->
        <validFrom>?</validFrom>
        <!--Optional:-->
        <validTo>?</validTo>
        <!--Optional:-->
        <version>?</version>
      </sourceAccount>
      <!--Optional:-->
      <amount>?</amount>
      <!--Optional:-->
      <eventTypeName>?</eventTypeName>
      <!--Optional:-->
      <description>?</description>
    </acc:script-template>
  </soapenv:Body>
</soapenv:Envelope>
